package com.hm.ncgyy.common.utils;

public class ConstantUtil {

	/** 行业类别 */
	public static String[] professions = { "餐饮", "农/林/牧/渔业", "家政保洁/安保", "美容/美发", "旅游", "娱乐/休闲", "保健按摩", "运动健身",
			"人事/行政/后勤", "司机", "高级管理", "销售", "客服", "贸易/采购", "超市/百货/零售", "淘宝职位", "房产中介", "酒店", "市场/媒介/公关", "广告/会展/咨询",
			"美术/设计/创意", "普工/技工", "生产管理/研发", "物流/仓储", "服装/纺织/食品", "质控/安防", "汽车制造/服务", "计算机/互联网/通信", "电子/电气", "机械/仪器仪表",
			"法律", "教育培训", "翻译", "编辑/出版/印刷", "财务/审计/统计", "金融/银行/证券/投资", "保险", "医院/医疗/护理", "制药/生物工程", "环保", "建筑", "物业管理",
			"其他" };

	/** 企业性质 */
	public static String[] propertys = { "外商独资", "合资", "上市公司", "国企", "国家机关", "事业单位", "民营/私企", "代表处", "非盈利性组织", "股份制",
			"其他" };

	/** 企业规模 */
	public static String[] scales = { "20人以下", "21-50人", "51-100人", "101-300人", "301-500人", "500人以上" };

	/** 薪资待遇 */
	public static String[] salarys = { "面议", "2000元以下", "2000-3000元", "3000-5000元", "5000-10000元", "10000元以上" };

	/** 工作年限 */
	public static String[] workingYearss = { "不限", "应届生", "1年以下", "1-3年", "3-5年", "5-10年", "10年以上" };

	/** 学历 */
	public static String[] educations = { "不限", "高中以下", "高中", "中专/技校", "大专", "本科", "硕士", "博士" };

	/** 融资类型 */
	public static String[] financingTypes = { "债权融资", "股权融资", "其他融资", "整体转让" };

	/** 投资方式 */
	public static String[] investTypes = { "股权投资", "债权投资", "金融投资", "BT/BOT 项目投资", "其它投资" };

	/** 资金类型 */
	public static String[] fundTypes = { "个人资金", "企业资金", "天使投资", "VC投资", "PE投资", "小额贷款", "典当公司", "担保公司", "金融租赁", "投资公司",
			"商业银行", "基金公司", "证券公司", "信托公司", "资产管理", "其它资金" };

	/** 运输方式 */
	public static String[] transportModes = { "公路运输", "铁路运输", "水路运输", "航空运输", "管道运输", "国际多式联运" };

	/** 货源类型 */
	public static String[] supplyTypes = { "重货", "轻货" };

}
